MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKW39A512VFT4/mcu.h
/*! @name LR_PD_CFG - PHY Long Range Preamble Detect Config */
/*! @{ */
#define XCVR_2P4GHZ_PHY_LR_PD_CFG_CORR_TH_MASK   (0xFFU)
#define XCVR_2P4GHZ_PHY_LR_PD_CFG_CORR_TH_SHIFT  (0U)
/*! CORR_TH - Correlation threshold applicable to preamble detection; uses (0,8,8) fixed-point format.
 */
#define XCVR_2P4GHZ_PHY_LR_PD_CFG_CORR_TH(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_PD_CFG_CORR_TH_SHIFT)) & XCVR_2P4GHZ_PHY_LR_PD_CFG_CORR_TH_MASK)
#define XCVR_2P4GHZ_PHY_LR_PD_CFG_FREQ_TH_MASK   (0x1F00U)
#define XCVR_2P4GHZ_PHY_LR_PD_CFG_FREQ_TH_SHIFT  (8U)
/*! FREQ_TH - Threshold used to compare CFO estimates in the LR preamble detector; uses ufix5_En5 format.
 */
#define XCVR_2P4GHZ_PHY_LR_PD_CFG_FREQ_TH(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_PD_CFG_FREQ_TH_SHIFT)) & XCVR_2P4GHZ_PHY_LR_PD_CFG_FREQ_TH_MASK)
#define XCVR_2P4GHZ_PHY_LR_PD_CFG_NO_PEAKS_MASK  (0x30000U)
#define XCVR_2P4GHZ_PHY_LR_PD_CFG_NO_PEAKS_SHIFT (16U)
/*! NO_PEAKS - Number of consecutive correlation values that have to exceed the PD correlation
 *    threshold,for the same preamble phase, to assert preamble found;
 *  0b00..2 peaks;
 *  0b01..3 peaks;
 *  0b10..4 peaks;
 *  0b11..5 peaks;
 */
#define XCVR_2P4GHZ_PHY_LR_PD_CFG_NO_PEAKS(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_PD_CFG_NO_PEAKS_SHIFT)) & XCVR_2P4GHZ_PHY_LR_PD_CFG_NO_PEAKS_MASK)
/*! @} */

/*! @name LR_PD_PH -  */
/*! @{ */
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF0_MASK       (0x3FU)
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF0_SHIFT      (0U)
/*! ref0 - Long range preamble reference waveform sample 12 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF0(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_PD_PH_REF0_SHIFT)) & XCVR_2P4GHZ_PHY_LR_PD_PH_REF0_MASK)
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF1_MASK       (0x3F00U)
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF1_SHIFT      (8U)
/*! ref1 - Long range preamble reference waveform sample 13 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF1(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_PD_PH_REF1_SHIFT)) & XCVR_2P4GHZ_PHY_LR_PD_PH_REF1_MASK)
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF2_MASK       (0x3F0000U)
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF2_SHIFT      (16U)
/*! ref2 - Long range preamble reference waveform sample 14 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF2(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_PD_PH_REF2_SHIFT)) & XCVR_2P4GHZ_PHY_LR_PD_PH_REF2_MASK)
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF3_MASK       (0x3F000000U)
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF3_SHIFT      (24U)
/*! ref3 - Long range preamble reference waveform sample 15 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_LR_PD_PH_REF3(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_PD_PH_REF3_SHIFT)) & XCVR_2P4GHZ_PHY_LR_PD_PH_REF3_MASK)
/*! @} */

/* The count of XCVR_2P4GHZ_PHY_LR_PD_PH */
#define XCVR_2P4GHZ_PHY_LR_PD_PH_COUNT           (4U)

/*! @name LR_PD_RO_PH -  */
/*! @{ */
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF0_MASK    (0x3FU)
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF0_SHIFT   (0U)
/*! ref0 - Long range preamble reference waveform sample 64 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF0(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF0_SHIFT)) & XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF0_MASK)
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF1_MASK    (0x3F00U)
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF1_SHIFT   (8U)
/*! ref1 - Long range preamble reference waveform sample 65 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF1(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF1_SHIFT)) & XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF1_MASK)
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF2_MASK    (0x3F0000U)
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF2_SHIFT   (16U)
/*! ref2 - Long range preamble reference waveform sample 66 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF2(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF2_SHIFT)) & XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF2_MASK)
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF3_MASK    (0x3F000000U)
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF3_SHIFT   (24U)
/*! ref3 - Long range preamble reference waveform sample 67 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF3(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF3_SHIFT)) & XCVR_2P4GHZ_PHY_LR_PD_RO_PH_REF3_MASK)
/*! @} */

/* The count of XCVR_2P4GHZ_PHY_LR_PD_RO_PH */
#define XCVR_2P4GHZ_PHY_LR_PD_RO_PH_COUNT        (13U)

/*! @name LR_AA_CFG - PHY Long Range AA Config */
/*! @{ */
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_COR_THRESH_MASK (0xFFU)
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_COR_THRESH_SHIFT (0U)
/*! AA_COR_THRESH - Threshold use to compare the correlation magnitude in the long-range AA correlator.
 */
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_COR_THRESH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_COR_THRESH_SHIFT)) & XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_COR_THRESH_MASK)
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_HAM_THRESH_MASK (0x3F00U)
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_HAM_THRESH_SHIFT (8U)
/*! AA_HAM_THRESH - Threshold use to compare the Hamming distance, between reference coded sequence
 *    and received coded sequence, in the long-range AA correlator.
 */
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_HAM_THRESH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_HAM_THRESH_SHIFT)) & XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_HAM_THRESH_MASK)
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_ACCESS_ADDR_HAM_MASK (0x1F0000U)
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_ACCESS_ADDR_HAM_SHIFT (16U)
/*! ACCESS_ADDR_HAM - Threshold use to compare the Hamming distance, between the reference AA
 *    sequence and the received Viterbi decoded AA sequence.
 */
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_ACCESS_ADDR_HAM(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_AA_CFG_ACCESS_ADDR_HAM_SHIFT)) & XCVR_2P4GHZ_PHY_LR_AA_CFG_ACCESS_ADDR_HAM_MASK)
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_LR_CORR_GAIN_MASK (0x3F000000U)
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_LR_CORR_GAIN_SHIFT (24U)
/*! AA_LR_CORR_GAIN - AA correlator gain. Format ufix6en3. This gain is applied to soft bits from
 *    the demodulator before they are used for address search synchronization.
 */
#define XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_LR_CORR_GAIN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_LR_CORR_GAIN_SHIFT)) & XCVR_2P4GHZ_PHY_LR_AA_CFG_AA_LR_CORR_GAIN_MASK)
/*! @} */

/*! @name LR_STAT - PHY Long Range Status */
/*! @{ */
#define XCVR_2P4GHZ_PHY_LR_STAT_DECODED_HAMM_DIST_MASK (0x3FU)
#define XCVR_2P4GHZ_PHY_LR_STAT_DECODED_HAMM_DIST_SHIFT (0U)
/*! DECODED_HAMM_DIST - Hamming distance between the reference sequence and the Viterbi decoded received sequence
 */
#define XCVR_2P4GHZ_PHY_LR_STAT_DECODED_HAMM_DIST(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_STAT_DECODED_HAMM_DIST_SHIFT)) & XCVR_2P4GHZ_PHY_LR_STAT_DECODED_HAMM_DIST_MASK)
#define XCVR_2P4GHZ_PHY_LR_STAT_AA_FOUND_MASK    (0x40U)
#define XCVR_2P4GHZ_PHY_LR_STAT_AA_FOUND_SHIFT   (6U)
/*! AA_FOUND - Indicates that a AA detect is active for both LR and uncoded.
 */
#define XCVR_2P4GHZ_PHY_LR_STAT_AA_FOUND(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_STAT_AA_FOUND_SHIFT)) & XCVR_2P4GHZ_PHY_LR_STAT_AA_FOUND_MASK)
#define XCVR_2P4GHZ_PHY_LR_STAT_CI_MASK          (0x80U)
#define XCVR_2P4GHZ_PHY_LR_STAT_CI_SHIFT         (7U)
/*! CI - CI received.
 */
#define XCVR_2P4GHZ_PHY_LR_STAT_CI(x)            (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_STAT_CI_SHIFT)) & XCVR_2P4GHZ_PHY_LR_STAT_CI_MASK)
#define XCVR_2P4GHZ_PHY_LR_STAT_CODED_HAMM_DIST_MASK (0x7F00U)
#define XCVR_2P4GHZ_PHY_LR_STAT_CODED_HAMM_DIST_SHIFT (8U)
/*! CODED_HAMM_DIST - Hamming distance between the coded reference sequence and the coded received sequence.
 */
#define XCVR_2P4GHZ_PHY_LR_STAT_CODED_HAMM_DIST(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_STAT_CODED_HAMM_DIST_SHIFT)) & XCVR_2P4GHZ_PHY_LR_STAT_CODED_HAMM_DIST_MASK)
#define XCVR_2P4GHZ_PHY_LR_STAT_AA_CORR_MAX_MASK (0xFF0000U)
#define XCVR_2P4GHZ_PHY_LR_STAT_AA_CORR_MAX_SHIFT (16U)
/*! AA_CORR_MAX - Indicates the AA correlation magnitude witnessed when AA match occurred
 */
#define XCVR_2P4GHZ_PHY_LR_STAT_AA_CORR_MAX(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_STAT_AA_CORR_MAX_SHIFT)) & XCVR_2P4GHZ_PHY_LR_STAT_AA_CORR_MAX_MASK)
#define XCVR_2P4GHZ_PHY_LR_STAT_CMAG_MAX_MASK    (0xFF000000U)
#define XCVR_2P4GHZ_PHY_LR_STAT_CMAG_MAX_SHIFT   (24U)
/*! CMAG_MAX - Indicates the maximum preamble correlation magnitude during preamble found
 */
#define XCVR_2P4GHZ_PHY_LR_STAT_CMAG_MAX(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_LR_STAT_CMAG_MAX_SHIFT)) & XCVR_2P4GHZ_PHY_LR_STAT_CMAG_MAX_MASK)
/*! @} */

